# Entrada e saída de dados

In [2]:
import pandas as pd

In [ ]:
df1 = pd.read_csv("Analisando Dados com Pandas & SQL\Analisando Dados com Pandas & SQL\Dataserts\exemplo.csv", sep = ",", decimal = ".")

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5 non-null      float64
 1   1       5 non-null      float64
 2   2       5 non-null      float64
 3   3       5 non-null      float64
dtypes: float64(4)
memory usage: 292.0 bytes

In [10]:
df1

          0         1         2         3
0 -0.394813 -0.694630  0.253393  0.602590
1 -2.134217  1.141381 -0.130142  0.690936
2 -0.223754  0.365133 -0.104233 -0.182788
3  0.108066  0.331332  0.053708 -0.280468
4  0.085290  0.740834 -0.596941  0.243950

In [ ]:
df2 = pd.read_csv("Analisando Dados com Pandas & SQL\Analisando Dados com Pandas & SQL\Dataserts\df1", sep= ",")

In [ ]:
df2

     Unnamed: 0         A         B         C         D
0    2000-01-01  1.339091 -0.163643 -0.646443  1.041233
1    2000-01-02 -0.774984  0.137034 -0.882716 -2.253382
2    2000-01-03 -0.921037 -0.482943 -0.417100  0.478638
3    2000-01-04 -1.738808 -0.072973  0.056517  0.015085
4    2000-01-05 -0.905980  1.778576  0.381918  0.291436
..          ...       ...       ...       ...       ...
995  2002-09-22  1.013897 -0.288680 -0.342295 -0.638537
996  2002-09-23 -0.642659 -0.104725 -0.631829 -0.909483
997  2002-09-24  0.370136  0.233219  0.535897 -1.552605
998  2002-09-25  0.183339  1.285783 -1.052593 -2.565844
999  2002-09-26  0.775133 -0.850374  0.486728 -1.053427

[1000 rows x 5 columns]

In [14]:
df1.to_csv("Analisando Dados com Pandas & SQL\Analisando Dados com Pandas & SQL\Dataserts\df1",sep=",", decimal=".")